LXI H, 0x0015    ; Загружаем адрес X1 (0015h) в HL
MOV A, M         ; Читаем X1 в аккумулятор

INX H            ; HL = 0016h (X2)
SUB M            ; A = X1 - X2
MOV D, A         ; Сохраняем (X1 - X2) в регистр D

INX H            ; HL = 0017h (X3)
MOV A, M         ; Читаем X3 в аккумулятор

INX H            ; HL = 0018h (X4)
SUB M            ; A = X3 - X4
MOV B, A         ; Сохраняем (X3 - X4) в регистр B
MOV A, D         ; Загружаем (X1 - X2) обратно в A
SUB B            ; A = (X1 - X2) - (X3 - X4)

INX H            ; HL = 0019h
MOV M, A         ; Сохраняем результат Y в память
HLT              ; Остановка процессора

ORG 0x0015  
DB 21, 2, 3, 11  

; https://www.sim8085.com/
; y=(x1-x2)-(x3-x4)
; 0x0015 - 21
; 0x0016 - 02
; 0x0017 - 03
; 0x0018 - 11
; Ожидаемый вывод
; 0x0019 - 27